results/gcs_balanced/fio-rw:rw-rwmixread:33-numjobs:1-iodepth:3-bs:4k.out
fio-rw:rw-rwmixread:33-numjobs:1-iodepth:3-bs:4k: (g=0): rw=rw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=3
fio-3.28
Starting 1 process
fio-rw:rw-rwmixread:33-numjobs:1-iodepth:3-bs:4k: Laying out IO file (1 file / 4096MiB)

fio-rw:rw-rwmixread:33-numjobs:1-iodepth:3-bs:4k: (groupid=0, jobs=1): err= 0: pid=18004: Sat Feb 24 09:19:38 2024
  read: IOPS=15.2k, BW=59.4MiB/s (62.3MB/s)(17.7GiB/305968msec)
    slat (nsec): min=1480, max=9902.9k, avg=5859.16, stdev=56785.66
    clat (usec): min=6, max=24490k, avg=50.07, stdev=28571.85
     lat (usec): min=8, max=24490k, avg=56.01, stdev=28571.90
    clat percentiles (usec):
     |  1.00th=[    8],  5.00th=[    8], 10.00th=[    9], 20.00th=[   10],
     | 30.00th=[   11], 40.00th=[   11], 50.00th=[   11], 60.00th=[   12],
     | 70.00th=[   13], 80.00th=[   13], 90.00th=[   14], 95.00th=[   16],
     | 99.00th=[   36], 99.50th=[   74], 99.90th=[  783], 99.95th=[  988],
     | 99.99th=[ 1385]
   bw (  KiB/s): min=31488, max=264528, per=100.00%, avg=193802.87, stdev=52449.65, samples=192
   iops        : min= 7872, max=66130, avg=48450.71, stdev=13112.41, samples=192
  write: IOPS=30.8k, BW=120MiB/s (126MB/s)(36.0GiB/305968msec); 0 zone resets
    slat (nsec): min=1877, max=3546.2k, avg=3667.45, stdev=2912.96
    clat (usec): min=6, max=24487k, avg=41.78, stdev=25124.05
     lat (usec): min=9, max=24487k, avg=45.55, stdev=25124.05
    clat percentiles (usec):
     |  1.00th=[    8],  5.00th=[    8], 10.00th=[    9], 20.00th=[   10],
     | 30.00th=[   11], 40.00th=[   11], 50.00th=[   11], 60.00th=[   12],
     | 70.00th=[   13], 80.00th=[   13], 90.00th=[   14], 95.00th=[   16],
     | 99.00th=[   36], 99.50th=[   75], 99.90th=[  775], 99.95th=[  988],
     | 99.99th=[ 1401]
   bw (  KiB/s): min=64896, max=534448, per=100.00%, avg=393280.22, stdev=106352.18, samples=192
   iops        : min=16224, max=133612, avg=98320.02, stdev=26588.05, samples=192
  lat (usec)   : 10=26.66%, 20=71.26%, 50=1.47%, 100=0.21%, 250=0.07%
  lat (usec)   : 500=0.07%, 750=0.14%, 1000=0.07%
  lat (msec)   : 2=0.04%, 4=0.01%, 10=0.01%, 750=0.01%, 2000=0.01%
  lat (msec)   : >=2000=0.01%
  cpu          : usr=10.15%, sys=16.98%, ctx=73416, majf=0, minf=24
  IO depths    : 1=0.1%, 2=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=4650516,9437185,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=3

Run status group 0 (all jobs):
   READ: bw=59.4MiB/s (62.3MB/s), 59.4MiB/s-59.4MiB/s (62.3MB/s-62.3MB/s), io=17.7GiB (19.0GB), run=305968-305968msec
  WRITE: bw=120MiB/s (126MB/s), 120MiB/s-120MiB/s (126MB/s-126MB/s), io=36.0GiB (38.7GB), run=305968-305968msec

Disk stats (read/write):
  sdc: ios=37100/165343, merge=0/11, ticks=62098/9399933, in_queue=9462033, util=89.09%