results/gcs_balanced/fio-rw:rw-rwmixread:66-numjobs:1-iodepth:1-bs:4k.out
fio-rw:rw-rwmixread:66-numjobs:1-iodepth:1-bs:4k: (g=0): rw=rw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
fio-3.28
Starting 1 process
fio-rw:rw-rwmixread:66-numjobs:1-iodepth:1-bs:4k: Laying out IO file (1 file / 4096MiB)

fio-rw:rw-rwmixread:66-numjobs:1-iodepth:1-bs:4k: (groupid=0, jobs=1): err= 0: pid=18549: Sat Feb 24 11:29:26 2024
  read: IOPS=33.8k, BW=132MiB/s (139MB/s)(38.8GiB/300696msec)
    slat (nsec): min=1442, max=45210k, avg=15699.86, stdev=131577.51
    clat (nsec): min=937, max=551106, avg=1056.80, stdev=714.77
     lat (usec): min=2, max=45220, avg=16.84, stdev=131.84
    clat percentiles (nsec):
     |  1.00th=[  964],  5.00th=[  964], 10.00th=[  972], 20.00th=[  980],
     | 30.00th=[  980], 40.00th=[  988], 50.00th=[  988], 60.00th=[  996],
     | 70.00th=[ 1004], 80.00th=[ 1032], 90.00th=[ 1112], 95.00th=[ 1128],
     | 99.00th=[ 2512], 99.50th=[ 3664], 99.90th=[ 8384], 99.95th=[15168],
     | 99.99th=[28288]
   bw (  KiB/s): min= 6152, max=629768, per=100.00%, avg=192972.15, stdev=92491.14, samples=422
   iops        : min= 1538, max=157442, avg=48242.99, stdev=23122.81, samples=422
  write: IOPS=17.4k, BW=68.1MiB/s (71.4MB/s)(20.0GiB/300696msec); 0 zone resets
    slat (nsec): min=1894, max=464882, avg=3572.16, stdev=1746.49
    clat (nsec): min=1000, max=632868, avg=1136.86, stdev=779.82
     lat (usec): min=3, max=637, avg= 4.80, stdev= 1.95
    clat percentiles (nsec):
     |  1.00th=[ 1032],  5.00th=[ 1048], 10.00th=[ 1064], 20.00th=[ 1064],
     | 30.00th=[ 1080], 40.00th=[ 1080], 50.00th=[ 1096], 60.00th=[ 1096],
     | 70.00th=[ 1112], 80.00th=[ 1144], 90.00th=[ 1208], 95.00th=[ 1224],
     | 99.00th=[ 1368], 99.50th=[ 1512], 99.90th=[ 8640], 99.95th=[15936],
     | 99.99th=[28800]
   bw (  KiB/s): min= 3376, max=323440, per=100.00%, avg=99426.14, stdev=47721.89, samples=422
   iops        : min=  844, max=80860, avg=24856.47, stdev=11930.49, samples=422
  lat (nsec)   : 1000=44.24%
  lat (usec)   : 2=54.91%, 4=0.54%, 10=0.22%, 20=0.05%, 50=0.03%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%
  cpu          : usr=9.67%, sys=18.02%, ctx=140482, majf=0, minf=18
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=10175695,5242881,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=132MiB/s (139MB/s), 132MiB/s-132MiB/s (139MB/s-139MB/s), io=38.8GiB (41.7GB), run=300696-300696msec
  WRITE: bw=68.1MiB/s (71.4MB/s), 68.1MiB/s-68.1MiB/s (71.4MB/s-71.4MB/s), io=20.0GiB (21.5GB), run=300696-300696msec

Disk stats (read/write):
  sdc: ios=132158/86730, merge=0/20, ticks=318444/4641958, in_queue=4960404, util=96.57%